# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'ack'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'doctl'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'wrk'
brew 'htop'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'ncdu'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zsh-autosuggestions'

# Development
brew 'php'
brew 'php@7.4'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'alfred'
cask 'bartender'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'homebrew/cask-versions/firefox-developer-edition'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'insomnia'
cask 'java'
cask 'nordvpn'
cask 'skype'
cask 'zoomus'
cask 'slack'
cask 'telegram'
cask 'cleanshot'
cask 'deezer'
cask 'deepl'
cask 'figma'
cask 'vlc'
cask 'rocket'

# Dev Tools
cask 'hyper'
cask 'phpstorm'
cask 'visual-studio-code'
cask 'tableplus'
cask 'mysqlworkbench'
cask 'tinerwell'
#cask 'sublime-text'
cask 'transmission'
cask 'transmit'
cask 'drawio'
cask 'runjs'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'betterzip'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'

# Mac App Store
mas '1Password', id: 1333542190
mas 'Byword', id: 420212497
mas 'Evernote', id: 406056744
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Spark', id: 1176895641
mas 'Pocket', id: 568494494
mas 'The Unarchiver', id: 425424353
mas 'Todoist: To-Do List & Tasks', id: 585829637
mas 'Tweetbot', id: 1384080005
